// Даден е масив, който съдържа информация за български владетели, и периода на тяхното управление.
// Всеки елемент на масива е масив със следните данни:
// 	[<име>, <начална година на управление>, <крайна година на управление>]

var rulers = [
	["асПАРуХ",681, 700 ], //0
	["тЕРвеЛ", 700,718 ], //1
	["СеВаР", 738,753], //2
	["телЕРИГ", 766,777], //3
	["каРДАм", 777, 803], //4
	["крум", 803,814 ], //5
	["ОмурТАг",814,831], //6
];

// ЗАДАЧА: Изпишете в конзолата имената на онези български владетели, които са управлявали повече от 15 години.
// Разбира се, искаме да видим имената изписани според конвенциите за имена на съществителни-собствени: за целта може да използвате върху всяко име функцията toCamelCaseCyr(), която връща подадения й низ в скобите конвертиран до CamelCase
// Например:
	// console.log( toCamelCaseCyr('асПАРуХ') ); // Аспарух

// >>>>>>>>>>НАЧАЛО НА ВАШИЯ КОД >>>>>>>>>> ()
function rulersYears() {
    for(let i=0; i < rulers.length; i++){
        let difference = rulers[i][2] - rulers[i][1];
       if (difference > 15){
        console.log(`${(rulers[i][0]).toUpperCase()} е управлявал ${difference} години.`)
       };
    }

};

rulersYears();
// <<<<<<<<<< КРАЙ НА ВАШИЯ КОД <<<<<<<<<<<<<

// Очакван резултат,в конзолата:
// Аспарух е управлявал 19 години.
// Тервел е управлявал 18 години.
// Кардам е управлявал 26 години.
// Омуртаг е управлявал 17 години.